package BW800Tcp

const (
	g_headnum = 12 //返回的数据报文头是12个字节的
)

//一些公用的函数
//-------------------------------------------------
//在计算byte的累加验证位，这是nm820采用的验证方式
//--------------------------------------------------
func Fun_SumCheck(date []byte) byte {
	var sum byte = 0x00
	for i := 0; i < len(date); i++ {
		sum = sum + date[i]
	}
	return sum
}

/*******************************去取包头，校验报文********************************************************
	功能：去取包头，校验报文
	输入：byte数组 ，输出：结构体用的byte数组
**************************************************************************************/
func Fun_handle_message(mes []byte) []byte {
	return mes[g_headnum : len(mes)-1]
}
